Repository: Zeyad-3nab/Gym-App
Catalog: Gym.Api.DAL/Resources/SharedResources.*.resx
Languages: ar

# AbilityOfSystemMoneyRequired
source: AbilityOfSystemMoney is required
ar: قدرتك علي دفع الاشتراك مطلوب

# AddressRequired
source: Address is required
ar: العنوان مطلوب

# AgeRequired
source: Age is required
ar: العمر مطلوب

# AimOfJoinRequired
source: AimOfJoin is required
ar: الهدف من التمرين مطلوب

# AllergyOfFoodRequried
source: AllergyOfFood is required
ar: الطعام المفضل مطلوب

# AnyInfectionRequired
source: AnyInfection is required
ar: هل تعاني من اي عدوي مطلوب

# AnyPainsRequired
source: AnyPains is required
ar: هل تعاني من اي اصابات مطلوب

# ApplicationUserIdRequired
source: UserId is required
ar: الرقم التعريفي للمستخدم مطلوب

# AreYouSomkerRequired
source: AreYouSomker is required
ar: هل انت مدخن ام لا مطلوب

# BadRequestMessage
source: a bad Request , You have made
ar: خطا ما انت فعلته

# DailyWorkRequired
source: DailyWork is required
ar: العمل اليومي مطلوب

# DurationRequired
source: Duration is required
ar: المده مطلوبه

# EmailAddressDataType
source: Should be Email Address
ar: يجب ان يكون من نوع بريد الكتروني

# EmailRequired
source: Email is required
ar: البريد الالكتروني مطلوب

# EndPackageRequired
source: EndPackage is required
ar: موعد الانتهاء مطلوب

# ErrorInPassword
source: Password with this Email InCorrect
ar: خطا في كلمه السر

# ErrorInSaving
source: Error in saveing please try again
ar: خطا في عمليه الحفظ حاول مره اخري

# ExerciseIdNotFound
source: Exercise with this Id is not found
ar: لا يوجد تمرين بهذا الرقم التعريفي

# ExerciseIdRequired
source: Exercise Id is required
ar: الرقم التعريفي للتمرين مطلوب

# FoodIdNotFound
source: Food with this Id is not found
ar: لا يوجد وجبه بهذا الرقم التعريفي

# FoodIdRequired
source: Food Id is required
ar: الرقم التعريفي للوجبه مطلوب

# FoodSystemRequired
source: FoodSystem is required
ar: نظام الطعام مطلوب

# GenderRequired
source: Gender is required
ar: النوع مطلوب

# IdRequired
source: Id is required
ar: الرقم التعريفي مطلوب

# ImageRequired
source: Image is required
ar: الصوره مطلوبه

# IsActiveRequired
source: IsActive is required
ar: مازالت فعاله ام لا مطلوبه

# LastExerciseRequired
source: LastExercise is required
ar: اخر تمرين مطلوب

# LongRequired
source: Long is required
ar: الطول مطلوب

# MaxLength100
source: Maximum length is 100
ar: اقصي عدد حروف هو 100

# NameRequired
source: Name is required
ar: الاسم مطلوب

# NewPriceRequired
source: NewPrice is required
ar: السعر الجديد مطلوب

# NumberOfDayesRequired
source: NumberOfDayes is required
ar: عدد الايام مطلوب

# NumberOfMealsRequired
source: NumberOfMeals is required
ar: عدد الوجبات اليوميه مطلوب

# NumOfCaloriesRequired
source: Number Of Calories is required
ar: عدد السعرات الحراريه مطلوبه

# NumOfCountRequired
source: Number Of Count is required
ar: عدد العدات في كل مجموعه مطلوب

# NumOfGramsRequired
source: Number Of Grams is required
ar: عدد الجرامات مطلوب

# NumOfGroupsRequired
source: Number Of Groups is required
ar: عدد المجموعات مطلوب

# NumOfProteinRequired
source: Number Of Protein is required
ar: عدد البروتينات مطلوبه

# OldPriceRequired
source: OldPrice is required
ar: السعر القديم مطلوب

# PackageIdNotFound
source: Package with this Id is not found
ar: لا توجد باقه بهذا الرقم التعريفي

# PackageIdRequried
source: PackageId is required
ar: الرقم التعريفي الباقه مطلوب

# PackageTypeRequired
source: Type is required
ar: نوع الباقه مطلوب

# PasswordDataType
source: Should be password
ar: يجب ان يكون من نوع رقم سري

# PasswordRequired
source: Password is required
ar: الرقم السري مطلوب

# PasswordShape
source: Password must be at least 8 characters long, include an uppercase letter, a lowercase letter, a number, and a special character.
ar: يجب أن تتكون كلمة المرور من 8 أحرف على الأقل، وتتضمن حرفًا كبيرًا، وحرفًا صغيرًا، ورقمًا، وحرفًا خاصًا.

# PhoneNumberRequired
source: Phone is required
ar: رقم الهاتف مطلوب

# StartPackageRequired
source: StartPackage is required
ar: موعد البدايه مطلوب

# TargetMuscleRequired
source: TargetMuscle is required
ar: العضله المستهدفه مطلوب

# TrainerDataIdNotFound
source: TrainerData with this Id is not found
ar: لا يوجد متدرب جديد بهذا الرقم التعريفي

source: User don't have this exercise
ar: هذا المستخدم لا يمتلك هذا التمرين

source: User don't have this food
ar: هذا المستخدم لا يمتلك هذا الطعام

# UserEmailNotFound
source: User with this Email is not found
ar: لا يوجد مستخدم بهذا البريد الالكتروني

# UserIdNotFound
source: User with this Id is not found
ar: لا يوجد مستخدم بهذا الرقم التعريفي

# UserIdRequired
source: User Id is required
ar: الرقم التعريفي للمستخدم مطلوب

# UserNameRequired
source: UserName is required
ar: اسم المستخدم مطلوب

# WeightRequired
source: Weight is required
ar: الوزن مطلوب
